# ETL Project

Team Members
- Harry Feldman
- Jessica Pardo
- Andrey Tokarev
- Raven Washington

In [1]:
# Import Dependencies

import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import psycopg2

# Get the password from config file
from config import password

## U.S. State Data

- U.S. State Tables (CSV file). Data source: http://www.whypad.com/posts/excel-spreadsheet-of-us-states/583/
- Quality Of Life by State (CSV file). Data source: https://worldpopulationreview.com/state-rankings/quality-of-life-by-state

### Extraction

In [38]:
# File path
states_csv = 'Resources/Raw_data/us_states.csv'

In [39]:
# Read csv and store in to Pandas Dataframe
col_Names=["STATE", "state_name", "state_abr"]
states_df= pd.read_csv(states_csv,names=col_Names)
states_df.head()

        STATE  state_name state_abr
0     ALABAMA     Alabama        AL
1      ALASKA      Alaska        AK
2     ARIZONA     Arizona        AZ
3    ARKANSAS    Arkansas        AR
4  CALIFORNIA  California        CA

In [40]:
# File path
ranking_csv = 'Resources/Raw_data/state_ranking.csv'

In [41]:
# Read csv and store in to Pandas Dataframe
ranking_df = pd.read_csv(ranking_csv)
ranking_df.head()

           State  lifeQualityRank  healthCareRank  educationRank  economyRank
0     Washington                1               4              4            3
1  New Hampshire                2              16              5           13
2      Minnesota                3              10             17           18
3           Utah                4               9             10            2
4        Vermont                5              11              8           29

### Transformation

In [42]:
states_df = states_df.drop(columns=['STATE'])
states_df.head()

   state_name state_abr
0     Alabama        AL
1      Alaska        AK
2     Arizona        AZ
3    Arkansas        AR
4  California        CA

In [43]:
ranking_df = ranking_df.rename(columns={'State':'state_name'})
ranking_df.head()

      state_name  lifeQualityRank  healthCareRank  educationRank  economyRank
0     Washington                1               4              4            3
1  New Hampshire                2              16              5           13
2      Minnesota                3              10             17           18
3           Utah                4               9             10            2
4        Vermont                5              11              8           29

In [44]:
state = pd.merge(left=states_df, right=ranking_df, how='left', left_on='state_name', right_on='state_name')
state.head()

,state_name,state_abr,lifeQualityRank,healthCareRank,educationRank,economyRank
0,Alabama,AL,49,46,50,45
1,Alaska,AK,44,25,47,46
2,Arizona,AZ,34,23,40,10
3,Arkansas,AR,45,49,42,43
4,California,CA,19,7,21,4

In [45]:
state.index.names = ['state_id']
state.head()

,state_name,state_abr,lifeQualityRank,healthCareRank,educationRank,economyRank
state_id,,,,,,
0,Alabama,AL,49,46,50,45
1,Alaska,AK,44,25,47,46
2,Arizona,AZ,34,23,40,10
3,Arkansas,AR,45,49,42,43
4,California,CA,19,7,21,4

In [10]:
# Export Data
state.to_csv(r'Resources/Clean_data/state.csv')

## Housing Data

- Zillow Economics Data(CSV file). Data source: https://www.kaggle.com/zillow/zecon

### Extraction

In [17]:
state_id_df = pd.read_csv("./Resources/Clean_data/state.csv")
state_id_df.head(3)

,state_id,state_name,state_abr,lifeQualityRank,healthCareRank,educationRank,economyRank
0,0,Alabama,AL,49,46,50,45
1,1,Alaska,AK,44,25,47,46
2,2,Arizona,AZ,34,23,40,10

In [18]:
housing_df = pd.read_csv("./Resources/Raw_data/State_time_series.csv")
housing_df.head(3)

,Date,RegionName,DaysOnZillow_AllHomes,InventorySeasonallyAdjusted_AllHomes,InventoryRaw_AllHomes,MedianListingPricePerSqft_1Bedroom,MedianListingPricePerSqft_2Bedroom,MedianListingPricePerSqft_3Bedroom,MedianListingPricePerSqft_4Bedroom,MedianListingPricePerSqft_5BedroomOrMore,...,ZHVI_BottomTier,ZHVI_CondoCoop,ZHVI_MiddleTier,ZHVI_SingleFamilyResidence,ZHVI_TopTier,ZRI_AllHomes,ZRI_AllHomesPlusMultifamily,ZriPerSqft_AllHomes,Zri_MultiFamilyResidenceRental,Zri_SingleFamilyResidenceRental
0,1996-04-30,Alabama,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,45600.0,99500.0,79500.0,79000.0,140200.0,NaN,NaN,NaN,NaN,NaN
1,1996-04-30,Arizona,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,67100.0,78900.0,103600.0,107500.0,168700.0,NaN,NaN,NaN,NaN,NaN
2,1996-04-30,Arkansas,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,38400.0,70300.0,64400.0,64500.0,115200.0,NaN,NaN,NaN,NaN,NaN

### Transformation

In [19]:
clean_housing_df = housing_df[['Date','RegionName', 'MedianListingPricePerSqft_AllHomes', 'MedianRentalPricePerSqft_AllHomes', 
                               'PctOfHomesDecreasingInValues_AllHomes', 'PctOfHomesIncreasingInValues_AllHomes']]
clean_housing_df.head(3)

,Date,RegionName,MedianListingPricePerSqft_AllHomes,MedianRentalPricePerSqft_AllHomes,PctOfHomesDecreasingInValues_AllHomes,PctOfHomesIncreasingInValues_AllHomes
0,1996-04-30,Alabama,NaN,NaN,NaN,NaN
1,1996-04-30,Arizona,NaN,NaN,NaN,NaN
2,1996-04-30,Arkansas,NaN,NaN,NaN,NaN

In [20]:
clean_housing_df = clean_housing_df.dropna()

In [21]:
# renaming columns according to the ERD

# state_id integer FK >- state.state_id
# date date
# MedianListingPricePerSqft_AllHomes integer
# MedianRentalPricePerSqft_AllHomes integer
# PctOfHomesDecreasingInValues_AllHomes float
# PctOfHomesIncreasingInValues_AllHomes float

clean_housing_df = clean_housing_df.rename(columns={"RegionName": "state_name", "Date": "date"})
clean_housing_df.head(3)

,date,state_name,MedianListingPricePerSqft_AllHomes,MedianRentalPricePerSqft_AllHomes,PctOfHomesDecreasingInValues_AllHomes,PctOfHomesIncreasingInValues_AllHomes
8231,2010-01-31,Georgia,94.303797,0.715309,67.15,25.88
8269,2010-01-31,Washington,169.014085,0.961538,78.82,14.58
8276,2010-02-28,Arkansas,88.310580,0.606187,40.91,48.71

In [22]:
clean_housing_df_merged = clean_housing_df.merge(state_id_df, how='inner', on='state_name', suffixes = None, copy = False)
clean_housing_df_merged.head(3)

TypeError: cannot unpack non-iterable NoneType object

In [23]:
clean_housing_df_merged.columns

NameError: name 'clean_housing_df_merged' is not defined

In [ ]:
housing_df_final = clean_housing_df_merged.drop(labels=['state_abr', 'state_name', 
                                                        'lifeQualityRank', 'healthCareRank',
                                                        'educationRank', 'economyRank'
                                                       ], axis=1)

In [ ]:
housing_df_final.columns

In [ ]:
housing_df_final.to_csv("./Resources/Clean_data/housing.csv", index = False)

## Income Data
- USA Income Levels by United States Census Bureau https://data.world/uscensusbureau/acs-2015-5-e-income/workspace/file?filename=USA_ZCTA.csv

### Extraction

In [24]:
income_df = pd.read_csv("./Resources/Raw_Data/USA_All_States.csv")

### Transformation

In [25]:
clean_income_df = income_df[['AreaName','B19001_001']]
clean_income_df = clean_income_df.dropna()

In [26]:
# Renaming columns according to ERD
# state_id integer FK >- state.state_id
# household_income float
# year integer

clean_income_df = clean_income_df.rename(columns={"AreaName": "state_name", "B19001_001": "household_income"})
clean_income_df.head(3)

  state_name  household_income
0    Alabama           1848325
1     Alaska            250969
2    Arizona           2412212

In [27]:
# adding "year" column
clean_income_df['year'] = 2015
clean_income_df.head(3)

  state_name  household_income  year
0    Alabama           1848325  2015
1     Alaska            250969  2015
2    Arizona           2412212  2015

In [28]:
# need to replace state_name with state_id column 
clean_income_df_merged = clean_income_df.merge(state_id_df, how='inner', on='state_name', suffixes = None, copy = False)
clean_income_df_merged.head(3)

TypeError: cannot unpack non-iterable NoneType object

In [ ]:
income_df_final = clean_income_df_merged.drop(labels=['state_abr', 'state_name', 
                                                        'lifeQualityRank', 'healthCareRank',
                                                        'educationRank', 'economyRank'
                                                       ], axis=1)

In [ ]:
income_df_final.columns

In [ ]:
income_df_final.to_csv("./Resources/Clean_data/income.csv", index = False)

## Crime Data
- US Crime rates by County
https://www.kaggle.com/mikejohnsonjr/united-states-crime-rates-by-county

### Extraction

In [29]:
crime_df = pd.read_csv("./Resources/Raw_data/crime_data_w_population_and_crime_rate.csv")
crime_df.head(3)

,county_name,crime_rate_per_100000,index,EDITION,PART,IDNO,CPOPARST,CPOPCRIM,AG_ARRST,AG_OFF,...,RAPE,ROBBERY,AGASSLT,BURGLRY,LARCENY,MVTHEFT,ARSON,population,FIPS_ST,FIPS_CTY
0,"St. Louis city, MO",1791.995377,1,1,4,1612,318667,318667,15,15,...,200,1778,3609,4995,13791,3543,464,318416,29,510
1,"Crittenden County, AR",1754.914968,2,1,4,130,50717,50717,4,4,...,38,165,662,1482,1753,189,28,49746,5,35
2,"Alexander County, IL",1664.700485,3,1,4,604,8040,8040,2,2,...,2,5,119,82,184,12,2,7629,17,3

### Transformation

In [30]:
crime_df[['county_name','state_abr']] = crime_df['county_name'].str.split(',',expand=True)
crime_df.head(3)

,county_name,crime_rate_per_100000,index,EDITION,PART,IDNO,CPOPARST,CPOPCRIM,AG_ARRST,AG_OFF,...,ROBBERY,AGASSLT,BURGLRY,LARCENY,MVTHEFT,ARSON,population,FIPS_ST,FIPS_CTY,state_abr
0,St. Louis city,1791.995377,1,1,4,1612,318667,318667,15,15,...,1778,3609,4995,13791,3543,464,318416,29,510,MO
1,Crittenden County,1754.914968,2,1,4,130,50717,50717,4,4,...,165,662,1482,1753,189,28,49746,5,35,AR
2,Alexander County,1664.700485,3,1,4,604,8040,8040,2,2,...,5,119,82,184,12,2,7629,17,3,IL

In [31]:
crime_df1 = crime_df.drop(labels=['index', 'EDITION', 'PART', 'IDNO'], axis=1)
crime_df1.head(3)

,county_name,crime_rate_per_100000,CPOPARST,CPOPCRIM,AG_ARRST,AG_OFF,COVIND,INDEX,MODINDX,MURDER,...,ROBBERY,AGASSLT,BURGLRY,LARCENY,MVTHEFT,ARSON,population,FIPS_ST,FIPS_CTY,state_abr
0,St. Louis city,1791.995377,318667,318667,15,15,100.0,5706,22329,119,...,1778,3609,4995,13791,3543,464,318416,29,510,MO
1,Crittenden County,1754.914968,50717,50717,4,4,100.0,873,3424,8,...,165,662,1482,1753,189,28,49746,5,35,AR
2,Alexander County,1664.700485,8040,8040,2,2,100.0,127,278,1,...,5,119,82,184,12,2,7629,17,3,IL

In [32]:
crime_df1['year'] = 2016
crime_df1.head(3)

,county_name,crime_rate_per_100000,CPOPARST,CPOPCRIM,AG_ARRST,AG_OFF,COVIND,INDEX,MODINDX,MURDER,...,AGASSLT,BURGLRY,LARCENY,MVTHEFT,ARSON,population,FIPS_ST,FIPS_CTY,state_abr,year
0,St. Louis city,1791.995377,318667,318667,15,15,100.0,5706,22329,119,...,3609,4995,13791,3543,464,318416,29,510,MO,2016
1,Crittenden County,1754.914968,50717,50717,4,4,100.0,873,3424,8,...,662,1482,1753,189,28,49746,5,35,AR,2016
2,Alexander County,1664.700485,8040,8040,2,2,100.0,127,278,1,...,119,82,184,12,2,7629,17,3,IL,2016

In [33]:
crime_df1.columns

Index(['county_name', 'crime_rate_per_100000', 'CPOPARST', 'CPOPCRIM',
       'AG_ARRST', 'AG_OFF', 'COVIND', 'INDEX', 'MODINDX', 'MURDER', 'RAPE',
       'ROBBERY', 'AGASSLT', 'BURGLRY', 'LARCENY', 'MVTHEFT', 'ARSON',
       'population', 'FIPS_ST', 'FIPS_CTY', 'state_abr', 'year'],
      dtype='object')

In [34]:
crime_df2 = crime_df1.groupby(['state_abr'])

In [35]:
crime_df_final = crime_df2.agg({
    'crime_rate_per_100000': 'mean',
    'CPOPARST': 'mean',
    'CPOPCRIM': 'mean',
    'AG_ARRST': 'mean',
    'AG_OFF': 'mean',
    'COVIND': 'mean',
    'INDEX': 'mean',
    'MODINDX': 'mean',
    'MURDER': 'mean',
    'RAPE': 'mean',
    'ROBBERY': 'mean',
    'AGASSLT': 'mean',
    'BURGLRY': 'mean',
    'LARCENY': 'mean',
    'MVTHEFT': 'mean',
    'ARSON': 'mean',
    'population': 'mean',
    'FIPS_ST': 'mean',
    'FIPS_CTY': 'mean',
    'year': 'mean'
}).reset_index()
crime_df_final.head(3)

,state_abr,crime_rate_per_100000,CPOPARST,CPOPCRIM,AG_ARRST,AG_OFF,COVIND,INDEX,MODINDX,MURDER,...,ROBBERY,AGASSLT,BURGLRY,LARCENY,MVTHEFT,ARSON,population,FIPS_ST,FIPS_CTY,year
0,AK,289.320957,20258.956522,20157.260870,1.347826,1.434783,100.000000,147.913043,710.869565,0.913043,...,25.695652,102.217391,77.434783,580.260870,53.173913,5.913043,31224.565217,2,147.0,2016
1,AL,385.645691,71970.492537,71316.417910,6.492537,6.253731,95.955690,320.492537,2487.134328,5.089552,...,74.447761,221.746269,700.417910,1641.029851,145.626866,15.298507,72145.104478,1,67.0,2016
2,AR,334.750727,39321.746667,38579.933333,3.720000,3.720000,97.768183,183.066667,1443.693333,2.306667,...,30.693333,133.760000,430.666667,937.693333,75.360000,7.520000,39458.306667,5,75.0,2016

In [36]:
# need to replace state_name with state_id column 
crime_df_final_merged = crime_df_final.merge(state_id_df, how='inner', on='state_abr', suffixes = None, copy = False)

TypeError: cannot unpack non-iterable NoneType object

In [37]:
crime_df_final_v2 = crime_df_final_merged.drop(labels=['state_abr', 'state_name', 
                                                        'lifeQualityRank', 'healthCareRank',
                                                        'educationRank', 'economyRank'
                                                       ], axis=1)

NameError: name 'crime_df_final_merged' is not defined

In [ ]:
crime_df_final_v2.columns

In [ ]:
crime_df_final_v2.to_csv("./Resources/Clean_data/crime.csv", index = False)

## Public school data
- Public School Data (CSV file) Data Source: https://www.kaggle.com/carlosaguayo/usa-public-schools

### Extraction

In [11]:
# File path
school_csv = 'Resources/Raw_data/public_schools.csv'

In [12]:
# Read csv and store in to Pandas DataFrame
schools_df = pd.read_csv(school_csv)
schools_df.head()

,X,Y,OBJECTID,NCESID,NAME,ADDRESS,CITY,STATE,ZIP,ZIP4,...,VAL_METHOD,VAL_DATE,WEBSITE,LEVEL_,ENROLLMENT,ST_GRADE,END_GRADE,DISTRICTID,FT_TEACHER,SHELTER_ID
0,-81.050895,29.022271,2002,120192008041,SAMSULA ACADEMY,248 N SAMSULA DR,NEW SMYRNA,FL,32168,8762,...,IMAGERY,2014-05-20T00:00:00.000Z,http://nces.ed.gov/GLOBALLOCATOR/sch_info_popu...,1,222,KG,05,1201920,13,NOT AVAILABLE
1,-92.507288,31.180659,2003,220129002344,CAROLINE DORMON JUNIOR HIGH SCHOOL,8906 HWY 165 SOUTH,WOODWORTH,LA,71485,NOT AVAILABLE,...,IMAGERY/OTHER,2015-06-19T00:00:00.000Z,http://nces.ed.gov/GLOBALLOCATOR/sch_info_popu...,1,312,PK,08,2201290,21,NOT AVAILABLE
2,-69.971880,43.908147,2004,230378023129,HARRIET BEECHER STOWE ELEMENTARY,44 MCKEEN STREET,BRUNSWICK,ME,4011,NOT AVAILABLE,...,IMAGERY,2014-05-07T00:00:00.000Z,http://nces.ed.gov/GLOBALLOCATOR/sch_info_popu...,1,739,02,05,2303780,52,NOT AVAILABLE
3,-89.542799,32.728496,2005,280252001118,LEAKE CENTRAL ELEMENTARY SCHOOL,603 HWY. 16 WEST,CARTHAGE,MS,39051,NOT AVAILABLE,...,IMAGERY/OTHER,2010-07-06T00:00:00.000Z,http://nces.ed.gov/GLOBALLOCATOR/sch_info_popu...,1,1159,PK,05,2802520,63,NOT AVAILABLE
4,-94.361775,39.364359,2006,291645000891,KEARNEY ELEM.,902 S JEFFERSON,KEARNEY,MO,64060,8518,...,IMAGERY/OTHER,2016-07-18T00:00:00.000Z,http://nces.ed.gov/GLOBALLOCATOR/sch_info_popu...,1,274,KG,05,2916450,22,NOT AVAILABLE

In [13]:
# File path
state_csv = 'Resources/Clean_data/state.csv'

In [14]:
# Read csv and store in to Pandas DataFrame
state_df = pd.read_csv(state_csv)
state_df.head()

,state_id,state_name,state_abr,lifeQualityRank,healthCareRank,educationRank,economyRank
0,0,Alabama,AL,49,46,50,45
1,1,Alaska,AK,44,25,47,46
2,2,Arizona,AZ,34,23,40,10
3,3,Arkansas,AR,45,49,42,43
4,4,California,CA,19,7,21,4

### Transformation

In [15]:
# Cleaning up the DataFrame
# Selecting the columns to be displayed
clean_schools_df = schools_df[['STATE', 'CITY', 'NAME', 'ADDRESS', 'ZIP', 'X', 'Y', 'DISTRICTID', 'ST_GRADE', 'END_GRADE']]
clean_schools_df

,STATE,CITY,NAME,ADDRESS,ZIP,X,Y,DISTRICTID,ST_GRADE,END_GRADE
0,FL,NEW SMYRNA,SAMSULA ACADEMY,248 N SAMSULA DR,32168,-81.050895,29.022271,1201920,KG,05
1,LA,WOODWORTH,CAROLINE DORMON JUNIOR HIGH SCHOOL,8906 HWY 165 SOUTH,71485,-92.507288,31.180659,2201290,PK,08
2,ME,BRUNSWICK,HARRIET BEECHER STOWE ELEMENTARY,44 MCKEEN STREET,4011,-69.971880,43.908147,2303780,02,05
3,MS,CARTHAGE,LEAKE CENTRAL ELEMENTARY SCHOOL,603 HWY. 16 WEST,39051,-89.542799,32.728496,2802520,PK,05
4,MO,KEARNEY,KEARNEY ELEM.,902 S JEFFERSON,64060,-94.361775,39.364359,2916450,KG,05
...,...,...,...,...,...,...,...,...,...,...
102365,MI,DETROIT,COVENANT HOUSE ACADEMY DETROIT - SOUTHWEST SITE,1450 25TH ST,48216,-83.085229,42.320632,2600322,09,12
102366,MI,SOUTH ROCKWOOD,FRED W. RITTER ELEMENTARY SCHOOL,5650 CARLETON ROCKWOOD RD,48179,-83.272599,42.062038,2601980,KG,04
102367,MS,DIBERVILLE,DIBERVILLE ELEM,4540 BRODIE ROAD,39540,-88.914089,30.436478,2801770,KG,03
102368,MO,KANSAS CITY,DAVIDSON ELEM.,5100 N HIGHLAND,64118,-94.558365,39.187941,2922800,PK,05
102369,MO,SPRINGFIELD,JUVENILE JUSTICE CTR.,1111 N ROBBERSON,65802,-93.291370,37.220353,2928860,07,12

In [16]:
# Dropping null values
clean_schools_df = clean_schools_df.dropna()
clean_schools_df

,STATE,CITY,NAME,ADDRESS,ZIP,X,Y,DISTRICTID,ST_GRADE,END_GRADE
0,FL,NEW SMYRNA,SAMSULA ACADEMY,248 N SAMSULA DR,32168,-81.050895,29.022271,1201920,KG,05
1,LA,WOODWORTH,CAROLINE DORMON JUNIOR HIGH SCHOOL,8906 HWY 165 SOUTH,71485,-92.507288,31.180659,2201290,PK,08
2,ME,BRUNSWICK,HARRIET BEECHER STOWE ELEMENTARY,44 MCKEEN STREET,4011,-69.971880,43.908147,2303780,02,05
3,MS,CARTHAGE,LEAKE CENTRAL ELEMENTARY SCHOOL,603 HWY. 16 WEST,39051,-89.542799,32.728496,2802520,PK,05
4,MO,KEARNEY,KEARNEY ELEM.,902 S JEFFERSON,64060,-94.361775,39.364359,2916450,KG,05
...,...,...,...,...,...,...,...,...,...,...
102365,MI,DETROIT,COVENANT HOUSE ACADEMY DETROIT - SOUTHWEST SITE,1450 25TH ST,48216,-83.085229,42.320632,2600322,09,12
102366,MI,SOUTH ROCKWOOD,FRED W. RITTER ELEMENTARY SCHOOL,5650 CARLETON ROCKWOOD RD,48179,-83.272599,42.062038,2601980,KG,04
102367,MS,DIBERVILLE,DIBERVILLE ELEM,4540 BRODIE ROAD,39540,-88.914089,30.436478,2801770,KG,03
102368,MO,KANSAS CITY,DAVIDSON ELEM.,5100 N HIGHLAND,64118,-94.558365,39.187941,2922800,PK,05
102369,MO,SPRINGFIELD,JUVENILE JUSTICE CTR.,1111 N ROBBERSON,65802,-93.291370,37.220353,2928860,07,12

In [17]:
# Renaiming Columns
clean_schools_df = clean_schools_df.rename(columns={'STATE':'state_abr', 'CITY':'City', 'NAME':'SchoolName', 'ADDRESS':'Address',
                                                    'ZIP':'Zip', 'DISTRICTID':'DistrictID', 'ST_GRADE':'StartGrade', 'END_GRADE':'EndGrade'})
clean_schools_df.head()

,state_abr,City,SchoolName,Address,Zip,X,Y,DistrictID,StartGrade,EndGrade
0,FL,NEW SMYRNA,SAMSULA ACADEMY,248 N SAMSULA DR,32168,-81.050895,29.022271,1201920,KG,05
1,LA,WOODWORTH,CAROLINE DORMON JUNIOR HIGH SCHOOL,8906 HWY 165 SOUTH,71485,-92.507288,31.180659,2201290,PK,08
2,ME,BRUNSWICK,HARRIET BEECHER STOWE ELEMENTARY,44 MCKEEN STREET,4011,-69.971880,43.908147,2303780,02,05
3,MS,CARTHAGE,LEAKE CENTRAL ELEMENTARY SCHOOL,603 HWY. 16 WEST,39051,-89.542799,32.728496,2802520,PK,05
4,MO,KEARNEY,KEARNEY ELEM.,902 S JEFFERSON,64060,-94.361775,39.364359,2916450,KG,05

In [18]:
# Merge table for state_id

public_schools_merge = pd.merge(left=state_df, right=clean_schools_df, how='right', left_on='state_abr', right_on='state_abr')
public_schools_merge.head()

,state_id,state_name,state_abr,lifeQualityRank,healthCareRank,educationRank,economyRank,City,SchoolName,Address,Zip,X,Y,DistrictID,StartGrade,EndGrade
0,0.0,Alabama,AL,49.0,46.0,50.0,45.0,LEEDS,LEEDS HIGH SCH,1500 GREENWAVE DRIVE,35094,-86.535935,33.548162,100011,09,12
1,0.0,Alabama,AL,49.0,46.0,50.0,45.0,CULLMAN,GOOD HOPE MIDDLE SCH,216 GOOD HOPE SCHOOL RD.,35057,-86.881057,34.102738,101020,06,08
2,0.0,Alabama,AL,49.0,46.0,50.0,45.0,GUNTERSVILLE,BRINDLEE MT MIDDLE SCH,1050 SCANT CITY ROAD,35976,-86.422337,34.377158,100006,06,08
3,0.0,Alabama,AL,49.0,46.0,50.0,45.0,SMITHS STATION,SMITH STATION FRESHMAN CTR,1150 LEE ROAD 298,36877,-85.099268,32.536590,102070,09,09
4,0.0,Alabama,AL,49.0,46.0,50.0,45.0,CLEVELAND,CLEVELAND ELEM SCH,115 STADIUM DR,35049,-86.572919,33.993417,100420,KG,06

In [19]:
# Selecting the columns to be displayed
public_schools = public_schools_merge[['state_id', 'City', 'SchoolName', 'Address', 'Zip', 'X', 'Y', 'DistrictID', 'StartGrade', 'EndGrade']]
public_schools

,state_id,City,SchoolName,Address,Zip,X,Y,DistrictID,StartGrade,EndGrade
0,0.0,LEEDS,LEEDS HIGH SCH,1500 GREENWAVE DRIVE,35094,-86.535935,33.548162,100011,09,12
1,0.0,CULLMAN,GOOD HOPE MIDDLE SCH,216 GOOD HOPE SCHOOL RD.,35057,-86.881057,34.102738,101020,06,08
2,0.0,GUNTERSVILLE,BRINDLEE MT MIDDLE SCH,1050 SCANT CITY ROAD,35976,-86.422337,34.377158,100006,06,08
3,0.0,SMITHS STATION,SMITH STATION FRESHMAN CTR,1150 LEE ROAD 298,36877,-85.099268,32.536590,102070,09,09
4,0.0,CLEVELAND,CLEVELAND ELEM SCH,115 STADIUM DR,35049,-86.572919,33.993417,100420,KG,06
...,...,...,...,...,...,...,...,...,...,...
102363,NaN,SAINT THOMAS,JOSEPH GOMEZ ELEMENTARY SCHOOL,142 ANNAS RETREAT,802,-64.919936,18.338171,7800030,KG,06
102364,NaN,SAINT JOHN,JULIUS E SPRAUVE,14 18 ESTATE ENIGHED,831,-64.793916,18.330464,7800030,KG,08
102365,NaN,SAINT THOMAS,LEONARD DOBER ELEMENTARY SCHOOL,9A 10B KRONPRINDSENS GADE,802,-64.925850,18.342520,7800030,04,06
102366,NaN,SAINT CROIX,RICARDO RICHARDS ELEMENTARY SCCHOOL,491 BARREN SPOT,850,-64.760782,17.725168,7800002,KG,06
102367,NaN,SAINT THOMAS,LOCKHART ELEMENTARY SCHOOL,41 ESTATE THOMAS,802,-64.917602,18.341950,7800030,KG,06

In [20]:
# Dropping null values
public_schools = public_schools.dropna()
public_schools

,state_id,City,SchoolName,Address,Zip,X,Y,DistrictID,StartGrade,EndGrade
0,0.0,LEEDS,LEEDS HIGH SCH,1500 GREENWAVE DRIVE,35094,-86.535935,33.548162,100011,09,12
1,0.0,CULLMAN,GOOD HOPE MIDDLE SCH,216 GOOD HOPE SCHOOL RD.,35057,-86.881057,34.102738,101020,06,08
2,0.0,GUNTERSVILLE,BRINDLEE MT MIDDLE SCH,1050 SCANT CITY ROAD,35976,-86.422337,34.377158,100006,06,08
3,0.0,SMITHS STATION,SMITH STATION FRESHMAN CTR,1150 LEE ROAD 298,36877,-85.099268,32.536590,102070,09,09
4,0.0,CLEVELAND,CLEVELAND ELEM SCH,115 STADIUM DR,35049,-86.572919,33.993417,100420,KG,06
...,...,...,...,...,...,...,...,...,...,...
100614,49.0,EVANSTON,HORIZON ALTERNATIVE SCHOOL,164 YELLOWCREEK RD,82931,-110.980300,41.259840,5602760,07,12
100615,49.0,CHEYENNE,ANDERSON ELEMENTARY,2204 PLAIN VIEW RD,82009,-104.786858,41.170001,5601980,KG,06
100616,49.0,EVANSTON,DAVIS MIDDLE SCHOOL,837 NO NAME ST,82931,-110.972237,41.260919,5602760,06,08
100617,49.0,SHERIDAN,FT. MACKENZIE,620 LEWIS ST,82801,-106.965030,44.803526,5605695,09,12
100618,49.0,POWDER RIVER,POWDER RIVER ELEMENTARY,35462 NOTCHES RD,82648,-106.988950,43.036013,5604510,KG,06

In [21]:
# Export Data
public_schools.to_csv(r'Resources/Clean_data/public_schools.csv', index = False)

## Unemployment Data
- USA Unemployment rate Dataset (CSV file) Data Source: https://www.kaggle.com/carlosaguayo/2018-unemployment-rate-by-county/version/1

### Extraction

In [2]:
# Grab unemployment csv
unemployment_df = pd.read_csv("./Resources/Raw_data/GeoFRED_Unemployment_Rate_by_County_Percent.csv")
unemployment_df.head()

,Series ID,Region Name,Region Code,2000,2001,2002,2003,2004,2005,2006,...,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,SCABBE1URN,"Abbeville County, SC",45001,3.8,6.6,7.7,9.1,8.2,7.7,8.8,...,14.2,13.6,12.5,10.6,9.5,7.7,6.9,5.5,4.6,4.2
1,LAACAD0URN,"Acadia Parish, LA",22001,5.8,6.0,6.3,6.8,5.8,6.1,3.6,...,6.5,7.3,6.7,6.0,6.0,5.8,6.9,7.4,5.9,5.4
2,VAACCO1URN,"Accomack County, VA",51001,3.0,3.4,4.2,4.4,4.7,4.7,4.3,...,6.5,7.9,8.4,7.9,7.2,6.7,5.5,5.0,4.9,4.1
3,IDADAC1URN,"Ada County, ID",16001,3.4,3.9,4.7,4.9,4.1,3.3,2.7,...,8.9,8.3,7.3,6.2,5.2,4.2,3.7,3.3,2.8,2.4
4,OKADAI1URN,"Adair County, OK",40001,3.5,4.1,4.8,7.8,6.2,4.8,4.4,...,8.0,10.5,9.2,9.1,9.8,8.0,6.1,5.9,5.0,4.4

In [3]:
# Extract State into its own column
unemployment_df[['Region Name','State']] = unemployment_df['Region Name'].str.split(',',expand=True)
unemployment_df.head()

,Series ID,Region Name,Region Code,2000,2001,2002,2003,2004,2005,2006,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,State
0,SCABBE1URN,Abbeville County,45001,3.8,6.6,7.7,9.1,8.2,7.7,8.8,...,13.6,12.5,10.6,9.5,7.7,6.9,5.5,4.6,4.2,SC
1,LAACAD0URN,Acadia Parish,22001,5.8,6.0,6.3,6.8,5.8,6.1,3.6,...,7.3,6.7,6.0,6.0,5.8,6.9,7.4,5.9,5.4,LA
2,VAACCO1URN,Accomack County,51001,3.0,3.4,4.2,4.4,4.7,4.7,4.3,...,7.9,8.4,7.9,7.2,6.7,5.5,5.0,4.9,4.1,VA
3,IDADAC1URN,Ada County,16001,3.4,3.9,4.7,4.9,4.1,3.3,2.7,...,8.3,7.3,6.2,5.2,4.2,3.7,3.3,2.8,2.4,ID
4,OKADAI1URN,Adair County,40001,3.5,4.1,4.8,7.8,6.2,4.8,4.4,...,10.5,9.2,9.1,9.8,8.0,6.1,5.9,5.0,4.4,OK

### Transformation

In [4]:
# Clean up and reorganize

# Extract desired data only
unemployment_df1 = unemployment_df.drop(labels=['Series ID'], axis=1)
unemployment_df = unemployment_df[['State', 'Region Name', 'Region Code'] + [str(x) for x in range(2000, 2019)]]

# Reorganize years
unemployment_df = unemployment_df.melt(('State', 'Region Name', 'Region Code'), var_name='Year', value_name='Unemployment')
unemployment_df.head()

  State       Region Name  Region Code  Year  Unemployment
0    SC  Abbeville County        45001  2000           3.8
1    LA     Acadia Parish        22001  2000           5.8
2    VA   Accomack County        51001  2000           3.0
3    ID        Ada County        16001  2000           3.4
4    OK      Adair County        40001  2000           3.5

In [5]:
# Further normalize data. There should be a Region name-Region code table
regions = {'Code': [], 'Name': []}
for index, row in unemployment_df.iterrows():
    code = row['Region Code']
    if code in regions['Code']:
        continue
    regions['Code'].append(code)
    regions['Name'].append(row['Region Name'])
code_df = pd.DataFrame(regions)
code_df.head()

    Code              Name
0  45001  Abbeville County
1  22001     Acadia Parish
2  51001   Accomack County
3  16001        Ada County
4  40001      Adair County

In [6]:
# Delete Region Name column from the unemployment to avoid redunancy
del unemployment_df['Region Name']

In [7]:
# Join with state ID table
states = pd.read_csv('Resources/Clean_data/state.csv')


# Fix formatting
unemployment_df['State'] = unemployment_df['State'].apply(lambda x: x[1:])


unemployment_df = pd.merge(unemployment_df,
                 states, left_on='State',
                 right_on='state_abr',
                 how='inner')\
                [['state_id', 'Region Code', 'Year', 'Unemployment']]

In [8]:
code_df.head()

    Code              Name
0  45001  Abbeville County
1  22001     Acadia Parish
2  51001   Accomack County
3  16001        Ada County
4  40001      Adair County

In [9]:
# Save data
unemployment_df.to_csv('Resources/Clean_data/unemployment.csv')
code_df.to_csv('Resources/Clean_data/region_codes.csv')

## Load

In [10]:
# Create engine and connection to  db.

engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/US_quality_db')
connection = engine.connect()

- Postgresql Database table state

In [23]:
state_df.to_sql(name='state', con=engine, if_exists='append', index=False)

- Postgresql Database table Public School

In [24]:
public_schools.to_sql(name='public_schools', con=engine, if_exists='append', index=False)

## SQL Query

In [11]:
# Query the states from the state table into a Pandas dataframe
states_sql = pd.read_sql("SELECT * FROM state", connection)

# Displaying DF
states_sql.head()

,state_id,state_abr,state_name,lifeQualityRank,healthCareRank,educationRank,economyRank
0,0,AL,Alabama,49,46,50,45
1,1,AK,Alaska,44,25,47,46
2,2,AZ,Arizona,34,23,40,10
3,3,AR,Arkansas,45,49,42,43
4,4,CA,California,19,7,21,4

In [12]:
connection.close()